#+title: Homework 3:  Machine Learning for Language Understanding
#+author: Toni Kazic
#+date: Fall, 2025

# <2023-10-24 Tue>


#+SETUPFILE: "../../../common/preamble.org"
#+LATEX_CLASS: article
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil

#+LATEX_HEADER: \usepackage{langsci-avm}
# http://ftp.math.purdue.edu/mirrors/ctan.org/macros/latex/contrib/langsci-avm/langsci-avm.pdf

#+LATEX_HEADER: \newcommand{\grmr}[2]{\ensuremath{\mathrm{#1} & \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\txtgrmr}[2]{\ensuremath{\mathrm{#1} \,\longrightarrow\, \mathrm{#2}}}
#+LATEX_HEADER: \newcommand{\grmrhs}[1]{\ensuremath{& \,\longrightarrow\, \mathrm{#1} }}
#+LATEX_HEADER: \newcommand{\wa}[1]{\type{\textnormal{\w{#1}}}}

# compile with pdflatex
#
# Kazic, 3.11.2020



* DONE Introduction

This homework explores the course objective of understanding and
generating machine learning approaches, taking us into (shallow) machine
learning for language understanding. This will give us a chance to consider
the problem of usefully embedding language in numerically defined spaces,
giving us a chance to compare a seat-of-the-pants approach to the more
sophisticated ones we discussed in class.  It also gives us an opportunity
to compare different classifiers for different corpora and get an idea of
how well they perform.


NLTK has some classifiers, but [[http://scikit-learn.org/stable/user_guide.html][scikit-learn]] has more (so be sure to install
any needed modules!).  Let's jump off the deep end together and see how
far we can get.



# We'll revisit the feature extraction problem in the future, so
# this homework explores how well guessed features perform.

# At the end we look briefly at checking coherence using bags of
# words (see [[http://www.nltk.org/book/ch06.html][Section 2.3 ff]] for a short discussion and examples).  This is
# one technique for recognizing textual entailment.




* DONE Who's Who and Solution Patterns
<<whoswho>>

** Lead Person:  green


** Group Members

| first name last name | color                         |
|----------------------+-------------------------------|
|Nick Allegretti       | green \color{green}\rule{5mm}{3mm} |
|Dan Sparks            | yellow \color{yellow}\rule{5mm}{3mm} |
|Rohitha               | purple \color{violet}\rule{5mm}{3mm} |



** *Special Instructions for this Homework!*

All group members are to work on problem 6 together.  I want you to have
enough scope to play around with the embeddings and clustering algorithms.

Corpus: reuters


** Three Member Solution Patterns

$i$ is the question number.

#+begin_center
#+ATTR_LaTeX: :mode inline-math :environment array
| \text{color}                  | \text{draft solution} | \text{revise solution} |
|-------------------------------+----------------+-----------------|
| green \color{green}\rule{5mm}{3mm} | i \mod 3 = 1   | i \mod 3 = 0    |
| yellow \color{yellow}\rule{5mm}{3mm} | i \mod 3 = 2   | i \mod 3 = 1    |
| purple \color{violet}\rule{5mm}{3mm} | i \mod 3 = 0   | i \mod 3 = 2    |
#+end_center

** Two Member Solution Patterns

| color                         | draft solution | revise solution |
|-------------------------------+----------------+-----------------|
| green \color{green}\rule{5mm}{3mm} | odds           | evens           |
| yellow \color{yellow}\rule{5mm}{3mm} | evens          | odds            |




* DONE General Instructions
  + /Fill out the group members table and follow the solution patterns/ in
     Section [[whoswho]].

   + /If the question is unclear, tell me your interpretation of it as part
     of your answer./  Feel free to ask about the questions in class or on
     the Slack channel (use =@channel= as others will probably be puzzled
     too). 

   + /For questions using corpora, use the corpus of the lead person./

   + /Put your draft answers right after each question using a *complete,
     functional* =org= mode code or example block./ Make sure your code
     block is complete and functional by testing it in your copy of this
     homework file.

   + /Each group member reviews the others' draft solutions and you revise them together/.

   + /Discuss each other's draft and reviews, finalizing the answers./

   + /Show all your work: code, results, and analysis./  Does your code
     work in this file and produce *exactly* the results you show? 

   + /Post the completed file to Canvas no later than noon on the Tuesday
     indicated/ in the [[../syllabus.org::schedule][schedule in the syllabus]], naming your file with each
     person's first name (no spaces in the file name, and don't forget the
     =.org= extension!).  Only one person should submit the final file.


* DONE Hints


** joblib.dump() and joblib.load()

Note that for big data, the [[http://scikit-learn.org/stable/tutorial/basic/tutorial.html][scikit-learn tutorial]] suggests using
joblib.dump() and joblib.load().  However this only writes to disk, not a
string, but can store models and classifiers.


** I expect you to bring questions and struggles with problems 4 and 5 to class!


** You may need to reformat the data generated by NLTK for the [[http://scikit-learn.org/stable/modules/feature_extraction.html][scikit-learn code]].


** You may need to cope with [[http://scikit-learn.org/stable/auto_examples/text/document_classification_20newsgroups.html#sphx-glr-auto-examples-text-document-classification-20newsgroups-py][sparse data]] in scikit-learn.

One reason to use the universal tagset is that it doesn't have very many
tags, but depending on your corpus, your suffixes may have more than is
really desirable for problem 4.




* DONE Questions

# revised for exclusions for 2024
#
# Kazic, 12.12.2023

1. [@1] <<tagging>> Randomly select 1000 POS-tagged words from your
   assigned category/corpus and form your training and testing sets so that
   you train on 90% of the words and test on 10%.  Exclude stop words,
   numbers, and words of length three or less. Use the universal POS
   tagset. *If your corpus isn't tagged, choose a tagged corpus.* Using a
   tagger to tag it won't help much as it doesn't make a gold standard
   (that requires hand-checking by expert grammarians).  Save these somehow
   so you can re-use them in the [[fea-set][next]] problem.

   #+begin_example
   Reuters is not POS tagged.
   Using Brown instead.
   Using News category since no assigned category.
   #+end_example

   #+begin_src python :results output
     import random
     import re
     import json

     import nltk
     from nltk.corpus import brown, stopwords


     def is_number_token(word):
         number_pattern = re.compile(r"^\d+(\.\d+)?$")
         return bool(number_pattern.match(word))

     def main():
         nltk.download("brown")
         nltk.download("universal_tagset")
         nltk.download("stopwords")

         # No assigned category using news
         brown_category = "news"
         n_samples = 1000
         train_ratio = 0.9

         # Load tagged words
         tagged_words = brown.tagged_words(
             categories=brown_category,
             tagset="universal"
         )
         print(
             "Total tagged tokens in Brown {}: {}".format(
                 brown_category, len(tagged_words)
             )
         )

         english_stops = set(stopwords.words("english"))

         filtered = []
         for (word, tag) in tagged_words:
             w_lower = word.lower()

             # Exclude stopwords
             if w_lower in english_stops:
                 continue

             # Exclude short words
             if len(word) <= 3:
                 continue

             # Exclude numbers
             if is_number_token(word) or tag == "NUM":
                 continue

             filtered.append((word, tag))

         print("Tokens after filtering: {}".format(len(filtered)))

         if len(filtered) < n_samples:
             raise ValueError(
                 "Not enough tokens after filtering ({} found, need at least {})."
                 .format(len(filtered), n_samples)
             )

         # Random sample of 1000 tokens
         random.seed(42)      # for reproducibility
         sample = random.sample(filtered, n_samples)
         random.shuffle(sample)

         # Train / test split
         train_size = int(train_ratio * n_samples)
         train_data = sample[:train_size]
         test_data = sample[train_size:]

         print("Train size: {}".format(len(train_data)))
         print("Test size:  {}".format(len(test_data)))

         # print("First 5 train examples:", train_data[:5])
         # print("First 5 test examples:", test_data[:5])

         #Save to JSON for use in other questions
         json_train = [{"word": w, "tag": t} for (w, t) in train_data]
         json_test = [{"word": w, "tag": t} for (w, t) in test_data]

         output = {
             "corpus": "brown",
             "category": brown_category,
             "n_samples": n_samples,
             "train": json_train,
             "test": json_test,
         }

         out_file = "brown_news_pos_splits.json"
         with open(out_file, "w", encoding="utf-8") as f:
             json.dump(output, f, indent=2)

         print("Saved train/test data to {}".format(out_file))

     if __name__ == "__main__":
         main()


   #+end_src
   #+RESULTS:
   : Total tagged tokens in Brown news: 100554
   : Tokens after filtering: 45840
   : Train size: 900
   : Test size:  100
   : Saved train/test data to brown_news_pos_splits.json
   


# amended to remove confusing dictionary suggestion
#
# Kazic, 3.12.2024

2. [@2] <<fea-set>> For each of tuples in your training set in problem
   [[tagging]], extract the last *three /letters/ for the word* and its entire
   tag, and compile these into an NLTK feature set.  Check to see if the
   same feature is mapped to more than one tag and if so, then retag that
   feature with 'X'.  Again, save the feature set for reuse as a file.  *Do
   the same for the test set.*

#+begin_src python :results output
import json
import nltk
from collections import defaultdict

# extract last 3 letters as features and their tags
def extract_features_and_check_conflicts(tagged_words, dataset_name):
    feature_to_tags = defaultdict(set)
    feature_set = []


    # first pass
    for word, tag in tagged_words:
        suffix = word[-3:].lower()
        feature_to_tags[suffix].add(tag)

    # Find conflicting features (mapped to more than one tag)
    conflicting_features = {feat for feat, tags in feature_to_tags.items() if len(tags) > 1}

    print('Dataset: {}'.format(dataset_name))
    print('Total unique suffixes: {}'.format(len(feature_to_tags)))
    print('Conflicting suffixes: {}'.format(len(conflicting_features)))

    if conflicting_features:
        print('Examples of conflicting suffixes and their tags:')
        for feat in list(conflicting_features)[:5]:
            print('  Suffix: {}, Tags: {}'.format(feat, feature_to_tags[feat]))

    # second pass

    for word, tag in tagged_words:
        suffix = word[-3:].lower()

        if suffix in conflicting_features:
            final_tag = 'X'
        else:
            final_tag = tag

        features = {'suffix': suffix}
        feature_set.append((features, final_tag))

    return feature_set, conflicting_features

def main():
    with open('brown_news_pos_splits.json', 'r') as f:
        data = json.load(f)

    train_data = [(item['word'], item['tag']) for item in data['train']]
    test_data = [(item['word'], item['tag']) for item in data['test']]

    print('Loaded {} training samples and {} test samples.'.format(len(train_data), len(test_data)))

    #process training set
    train_feature_set, train_conflicts = extract_features_and_check_conflicts(train_data, 'Training')

    test_feature_set, test_conflicts = extract_features_and_check_conflicts(test_data, 'Test')

    print('\nFeature set examples (first 5 from training):')
    for i, (features, tag) in enumerate(train_feature_set[:5]):
        print('  {} -> {}'.format(features, tag))

    train_output = {
        'feature_set': train_feature_set,
        'conflicting_suffixes': list(train_conflicts),
        'dataset': 'training'
    }

    test_output = {
        'feature_set': test_feature_set,
        'conflicting_features': list(test_conflicts),
        'dataset': 'test'
    }

    with open('train_features.json', 'w', encoding='utf-8') as f:
        #serialize
        serializable_train = {
            'feature_set': [(dict(feat), tag) for feat, tag in train_feature_set],
            'conflicting_features': list(train_conflicts),
            'dataset': 'training'
        }
        json.dump(serializable_train, f, indent=2)

    with open('test_features.json', 'w', encoding='utf-8') as f:
       # serializable
        serializable_test = {
            'feature_set': [(dict(feat), tag) for feat, tag in test_feature_set],
            'conflicting_features': list(test_conflicts),
            'dataset': 'test'
        }
        json.dump(serializable_test, f, indent=2)

    print('\nFeature sets saved to train_features.json and test_features.json')

    #summary
    print('\nSummary:')
    print('training set: {} features, {} retagged as X'.format(len(train_feature_set), sum(1 for _, tag in train_feature_set if tag == 'X')))
    print('test set: {} features, {} retagged as X'.format(len(test_feature_set), sum(1 for _, tag in test_feature_set if tag == 'X')))


if __name__ == "__main__":
    main()

#+end_src
#+RESULTS:
#+begin_example
Loaded 900 training samples and 100 test samples.
Dataset: Training
Total unique suffixes: 370
Conflicting suffixes: 73
Examples of conflicting suffixes and their tags:
  Suffix: ast, Tags: {'ADJ', 'NOUN', 'ADP'}
  Suffix: ate, Tags: {'ADJ', 'NOUN'}
  Suffix: ood, Tags: {'NOUN', 'ADJ'}
  Suffix: all, Tags: {'ADJ', 'NOUN'}
  Suffix: r's, Tags: {'NOUN', 'DET'}
Dataset: Test
Total unique suffixes: 82
Conflicting suffixes: 1
Examples of conflicting suffixes and their tags:
  Suffix: ing, Tags: {'NOUN', 'VERB'}

Feature set examples (first 5 from training):
  {'suffix': 'ing'} -> X
  {'suffix': 'are'} -> NOUN
  {'suffix': 'uns'} -> NOUN
  {'suffix': 'tly'} -> ADV
  {'suffix': 'ile'} -> NOUN

Feature sets saved to train_features.json and test_features.json

Summary:
training set: 900 features, 341 retagged as X
test set: 100 features, 3 retagged as X
#+end_example


3. [@3] <<bayesian>> Now train a naive Bayes classifier using the one in
   NLTK or scikit-learn on your saved [[fea-set][feature set]] and show its accuracy.
   Show the ten most informative features (for sure you can get this from
   the NLTK naive Bayes classifier).

      #+begin_src python :results output
import json
import nltk
from nltk.classify import NaiveBayesClassifier
from collections import Counter, defaultdict


def load_feature_set(path):
    with open(path, "r", encoding="utf-8") as f:
        data = json.load(f)

    feature_set = []
    for feat_dict, tag in data["feature_set"]:
        feature_set.append((feat_dict, tag))

    return feature_set


def show_custom_informative_suffixes(train_features, n=10):
    suffix_label_counts = defaultdict(Counter)
    label_counts = Counter()

    for feats, tag in train_features:
        suffix = feats["suffix"]
        suffix_label_counts[suffix][tag] += 1
        label_counts[tag] += 1

    # Overall label distribution
    total_labels = sum(label_counts.values())
    if total_labels == 0:
        print("\nCustom informative suffixes:")
        return

    label_probs = {label: count / total_labels for label, count in label_counts.items()}

    scores = []
    for suffix, counts in suffix_label_counts.items():
        total_suffix = sum(counts.values())
        if total_suffix == 0:
            continue

        for label, count in counts.items():
            p_l_given_suffix = count / total_suffix
            p_l = label_probs.get(label, 0.0)
            if p_l == 0.0:
                continue
            ratio = p_l_given_suffix / p_l
            scores.append(((suffix, label), ratio, count))

    # Sort by how much the suffix boosts the tag probability
    scores.sort(key=lambda x: x[1], reverse=True)

    print("\nCustom most informative suffixes:")
    if not scores:
        print("  (No informative suffixes found under this scoring scheme.)")
        return

    for (suffix, label), ratio, count in scores[:n]:
        print(f"suffix={suffix!r:>5} -> {label:>5}   ratio={ratio:6.2f}   count={count}")


def main():
    # Load previously saved feature sets
    train_features = load_feature_set("train_features.json")
    test_features = load_feature_set("test_features.json")

    print("Loaded {} training instances and {} test instances."
          .format(len(train_features), len(test_features)))

    # Train Naive Bayes classifier
    classifier = NaiveBayesClassifier.train(train_features)

    # Compute accuracy on train and test sets
    train_accuracy = nltk.classify.accuracy(classifier, train_features)
    test_accuracy = nltk.classify.accuracy(classifier, test_features)

    print("\nAccuracy:")
    print("  Training accuracy: {:.4f}".format(train_accuracy))
    print("  Test accuracy:     {:.4f}".format(test_accuracy))

    # NLTK's default most informative features only print the header due to Q2 retagging
    print("\nTen most informative features (NLTK view):")
    classifier.show_most_informative_features(10)

    # Custom informative suffix analysis
    show_custom_informative_suffixes(train_features, n=10)


if __name__ == "__main__":
    main()

      #+end_src
      #+RESULTS:
      #+begin_example
      Loaded 900 training instances and 100 test instances.

      Accuracy:
	Training accuracy: 0.9622
	Test accuracy:     0.6200

      Ten most informative features (NLTK view):
      Most Informative Features

      Custom most informative suffixes:
      suffix='ike' ->   ADP   ratio=450.00   count=2
      suffix='lus' ->  CONJ   ratio=450.00   count=2
      suffix='tly' ->   ADV   ratio= 52.94   count=2
      suffix='hus' ->   ADV   ratio= 52.94   count=1
      suffix='.m.' ->   ADV   ratio= 52.94   count=1
      suffix='lso' ->   ADV   ratio= 52.94   count=4
      suffix='lse' ->   ADV   ratio= 52.94   count=1
      suffix='nly' ->   ADV   ratio= 52.94   count=1
      suffix='ily' ->   ADV   ratio= 52.94   count=2
      suffix='oat' ->   ADV   ratio= 52.94   count=1
      #+end_example



4. [@4] <<lda>> Continuing with the Bayesian theme of problem [[bayesian]],
   let's try some [[http://scikit-learn.org/stable/modules/generated/sklearn.discriminant_analysis.LinearDiscriminantAnalysis.html#sklearn.discriminant_analysis.LinearDiscriminantAnalysis][linear discriminant analysis]] with the algorithm found in
   *scikit-learn*, using the tags in the saved [[fea-set][feature set]] as the labels we
   want to learn.  Again, the question we're asking is how well do the
   three-letter suffixes predict the tags, so this is a multiclass LDA
   problem; the example on the man page shows a two-class problem.  We'll
   use the default =svd= method with no shrinkage, both because it's a good
   place to start and because it may be able to cope with the size of our
   tag and feature sets.  Return the output of the =decision_function= and
   =score= functions after training and testing the classifier.  Compute
   the LDA with and without downcasing and compare and discuss the results.




# two draws w/o replacement of anchors and successors; compare
# permute
# re-draw same anchors with new successors, and then compare all four



# rewritten <2023-10-31 Tue>

5. [@5] <<bow>> One feature that might be helpful in distinguishing
   machine-generated texts is repetition from sentence to sentence.  Let's
   explore that hypothesis informally.  One way we can approach that
   problem is by comparing significant words (that is, non-stop words)
   between each sentence and its successor sentence in a corpus.  We'll use
   the Brown corpus, category news, for this problem.  Go ahead and
   downcase unless you want to explain why you don't think it's a good
   idea.

    For 700 randomly selected sentences in the Brown news corpus (the
   ``first anchor sentences''), and their immediately succeeding sentences
   (''first set of successors''), form bags of the significant words for
   each pair of sentences (so really, these are paired data) and then
   compute the intersection between each pair of bags (so, 700 intersecting
   bags of words).  This is the baseline comparison.

   Tabulate these and compare the results to another randomly drawn 700
   sentences (''second anchor sentences''), ensuring that there are no
   duplicates between the first anchor sentences and the second anchor
   sentences and their successors (sampling without replacement).  Permute
   all sentences in the corpus, then draw the same second anchor sentences
   and their new successors and repeat computing the intersecting bags of
   significant words.   So you'll have three intersecting bags of
   significant words:
      + first anchor and their successors (overall baseline)
      + second anchor and their successors, ensuring that intersection of
        first and second anchors is empty (control for second anchors BOWs)
      + second anchor and new successors after permutation (the experiment).


   Compare and discuss the results.  You may use methods from NLTK,
   scikit-learn, or both for this problem: just be sure your code block is
   complete and self-contained.

         #+begin_src python :results output
	   import random
	   from collections import Counter

	   import nltk
	   from nltk.corpus import brown, stopwords

	   def sentence_to_bow(tokens, stopset):
	       words = []
	       for w in tokens:
	           w = w.lower()
	           if w.isalpha() and w not in stopset:
	               words.append(w)
	       return set(words)


	   def compute_intersections(anchor_indices, succ_indices, sentences, stopset):

	       sizes = []
	       for a_idx, s_idx in zip(anchor_indices, succ_indices):
	           bow_a = sentence_to_bow(sentences[a_idx], stopset)
	           bow_s = sentence_to_bow(sentences[s_idx], stopset)
	           sizes.append(len(bow_a & bow_s))
	       return sizes

	   def summarize(name, sizes):
	       cnt = Counter(sizes)
	       total = len(sizes)
	       mean_val = sum(sizes) / total if total > 0 else 0.0
	       print(f"{name}:")
	       print(f"Number of sentence pairs: {total}")
	       print(f"Mean intersection size:   {mean_val:.3f}")
	       print(f"Min / Max:                {min(sizes)} / {max(sizes)}")
	       print("Distribution (intersection size -> count, proportion):")
	       for k in sorted(cnt.keys()):
	           print(f"{k:2d}: {cnt[k]:4d} ({cnt[k]/total:6.3f})")

	   def main():
	       nltk.download("brown")
	       nltk.download("stopwords")
	       #Use Brown news sentences
	       sentences = list(brown.sents(categories="news"))
	       num_sent = len(sentences)
	       print(f"Total Brown 'news' sentences: {num_sent}")

	       valid_anchor_indices = list(range(num_sent - 1))
	       stopset = set(stopwords.words("english"))

	       # For reproducibility
	       random.seed(42)
	       n_pairs = 700

	       first_anchors = random.sample(valid_anchor_indices, n_pairs)
	       first_anchors = sorted(first_anchors)
	       first_succ = [i + 1 for i in first_anchors]

	       first_anchor_set = set(first_anchors)

	       # Second anchors/control
	       candidate_second_anchors = [
	           j for j in valid_anchor_indices
	           if (j not in first_anchor_set) and ((j + 1) not in first_anchor_set)
	       ]

	       second_anchors = random.sample(candidate_second_anchors, n_pairs)
	       second_anchors = sorted(second_anchors)
	       second_succ = [j + 1 for j in second_anchors]

	       # Baseline and control overlaps
	       baseline_intersections = compute_intersections(
	           first_anchors, first_succ, sentences, stopset
	       )
	       control_intersections = compute_intersections(
	           second_anchors, second_succ, sentences, stopset
	       )

	       indices = list(range(num_sent))

	       while True:
	           random.shuffle(indices)
	           pos_of = {orig_idx: pos for pos, orig_idx in enumerate(indices)}
	           if all(pos_of[a] < num_sent - 1 for a in second_anchors):
	               break

	       # For each second anchor find its new successor
	       perm_succ = []
	       for a_idx in second_anchors:
	           pos = pos_of[a_idx]
	           succ_pos = pos + 1
	           succ_idx = indices[succ_pos]
	           perm_succ.append(succ_idx)

	       experiment_intersections = compute_intersections(
	           second_anchors, perm_succ, sentences, stopset
	       )

	       summarize("Baseline: first anchors and successors", baseline_intersections)
	       summarize("Control: second anchors and successors", control_intersections)
	       summarize(
	           "Experiment: second anchors and new successors (after permutation)",
	           experiment_intersections,
	       )

	   if __name__ == "__main__":
	       main()
	 #+end_src
         #+RESULTS:
	 #+begin_example
	 Total Brown 'news' sentences: 4623
	 Baseline: first anchors and successors:
	 Number of sentence pairs: 700
	 Mean intersection size:   0.694
	 Min / Max:                0 / 6
	 Distribution (intersection size -> count, proportion):
	  0:  408 ( 0.583)
	  1:  168 ( 0.240)
	  2:   79 ( 0.113)
	  3:   24 ( 0.034)
	  4:   18 ( 0.026)
	  5:    2 ( 0.003)
	  6:    1 ( 0.001)
	 Control: second anchors and successors:
	 Number of sentence pairs: 700
	 Mean intersection size:   0.633
	 Min / Max:                0 / 7
	 Distribution (intersection size -> count, proportion):
	  0:  425 ( 0.607)
	  1:  168 ( 0.240)
	  2:   64 ( 0.091)
	  3:   33 ( 0.047)
	  4:    5 ( 0.007)
	  5:    3 ( 0.004)
	  6:    1 ( 0.001)
	  7:    1 ( 0.001)
	 Experiment: second anchors and new successors (after permutation):
	 Number of sentence pairs: 700
	 Mean intersection size:   0.054
	 Min / Max:                0 / 2
	 Distribution (intersection size -> count, proportion):
	  0:  664 ( 0.949)
	  1:   34 ( 0.049)
	  2:    2 ( 0.003)
	 #+end_example

         #+begin_example
	 In the Brown news corpus, neighboring sentences do share some important words, but not a lot.
	 When we randomize things, the overlap between the neighboring sentences almost disappears. In
	 the baseline, first anchors and their real successors, the mean intersection size is 0.694
	 words (0-6) with 58.3% of pairs sharing no significant words and 24% sharing only one word.
	 The control, second anchors and their real successors, look almost the same with a mean
	 interaction size of 0.633 words (0-7) with 60.7% pairs at zero overlap and 24% also sharing
	 only one word. This shows the effect is not simply a side effect of which anchors we picked.
	 In contrast, in the experiment, second anchors with new permuted successors, the mean
	 intersection size drops to 0.054 words (0-2) with 94.9% of pairs sharing nothing and almost no
	 pairs sharing more than one word. The significant drop after shuffling suggests that coherent,
	 human written news tends to have more local word repetition that random sentence pairs. However
	 the effect is weak enough that this feature alone would not make a strong classifier.
         #+end_example




# added notes on not relying on default cluster nums and
# checking quality of drawn data and enclosing plots
#
# Kazic, 13.12.2023
   
6. [@6] <<ml>> Choose 500 random sentences from the Brown news corpus
   tagged with the universal tagset.  For each sentence, identify the nouns
   and then compile a list of the three tags immediately preceeding each
   noun (excluding chunks smaller than three). (Ensure all your chosen
   sentences have at least one noun that occurs fourth or later in the
   list.)  Then encode each chunk in the list as a ternary tuple, mapping
   the tags to integers, and save the list of mapped tuples to disk using
   either pickle or json, as you wish.  Go ahead and downcase unless you
   want to explain why you don't think it's a good idea.

   Now cluster your saved encodings using the [[http://scikit-learn.org/stable/modules/generated/sklearn.cluster.MeanShift.html#sklearn.cluster.MeanShift][MeanShift]] and
   [[https://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html#sklearn.cluster.AgglomerativeClustering][AgglomerativeClustering]] algorithms from scikit-learn.  Do not rely on
   the default number of clusters for each method, but determine a good
   number of clusters for your data.  For MeanShift, take the remaining
   defaults; you may run it in parallel if you like and can.  Run
   AgglomerativeClustering thrice: first using "ward" for the linkage (it
   will only use a Euclidean metric); and then "average" for the linkage
   and "manhattan" and "cosine" for the metric.  Discuss the differences
   you find in the results of the different trials, referencing and
   enclosing your plots.





* DONE Grading Scale

This homework is worth 15 points. The grading scale is:


| fraction correctly reviewed and answered | points awarded |
|------------------------------------------+----------------|
| \(\ge 0.95\)                             |             15 |
| 0.90 -- 0.94                             |             14 |
| 0.85 -- 0.89                             |             13 |
| 0.80 -- 0.84                             |             12 |
| 0.75 -- 0.79                             |             11 |
| 0.70 -- 0.74                             |             10 |
| 0.65 -- 0.69                             |              9 |
| 0.60 -- 0.64                             |              8 |
| 0.55 -- 0.59                             |              7 |
| 0.50 -- 0.54                             |              6 |
| 0.45 -- 0.49                             |              5 |
| 0.40 -- 0.44                             |              4 |
| 0.35 -- 0.39                             |              3 |
| 0.30 -- 0.34                             |              2 |
| 0.25 -- 0.29                             |              1 |
| \(< 0.25\)                               |              0 |








* DONE Scoring


|     question | max pts | answer ok? |
|--------------+---------+------------|
|            1 |       1 |            |
|            2 |       1 |            |
|            3 |       2 |            |
|            4 |       2 |            |
|            5 |       2 |            |
|            6 |       7 |            |
|--------------+---------+------------|
|  total score |      15 |            |
|   percentage |         |            |
| total points |         |            |
#+TBLFM: @8$2=vsum(@I..@II)::@8$3=vsum(@I..@II)::@9$3=@-1/@-1$-1



